backend/fixtures/its_cheap_charge_ffs.json

{
  "authProviders": {},
  "aux": [],
  "availableVersion": "0.209.6",
  "battery": [
    {
      "power": -0.02,
      "capacity": 0,
      "soc": 8.3,
      "controllable": false
    }
  ],
  "batteryCapacity": 1,
  "batteryDischargeControl": false,
  "batteryEnergy": 0,
  "batteryGridChargeActive": false,
  "batteryMode": "unknown",
  "batteryPower": -0.02,
  "batterySoc": 8.3,
  "bufferSoc": 80,
  "bufferStartSoc": 0,
  "currency": "EUR",
  "eebus": false,
  "ext": [],
  "forecast": {
    "co2": [
      {
        "start": "2025-11-01T11:00:00+01:00",
        "end": "2025-11-01T12:00:00+01:00",
        "value": 161.11
      },
      {
        "start": "2025-11-01T12:00:00+01:00",
        "end": "2025-11-01T13:00:00+01:00",
        "value": 175.13
      },
      {
        "start": "2025-11-01T13:00:00+01:00",
        "end": "2025-11-01T14:00:00+01:00",
        "value": 204.33
      },
      {
        "start": "2025-11-01T14:00:00+01:00",
        "end": "2025-11-01T15:00:00+01:00",
        "value": 218.17
      },
      {
        "start": "2025-11-01T15:00:00+01:00",
        "end": "2025-11-01T16:00:00+01:00",
        "value": 229.47
      },
      {
        "start": "2025-11-01T16:00:00+01:00",
        "end": "2025-11-01T17:00:00+01:00",
        "value": 268.08
      },
      {
        "start": "2025-11-01T17:00:00+01:00",
        "end": "2025-11-01T18:00:00+01:00",
        "value": 264.02
      },
      {
        "start": "2025-11-01T18:00:00+01:00",
        "end": "2025-11-01T19:00:00+01:00",
        "value": 234.61
      },
      {
        "start": "2025-11-01T19:00:00+01:00",
        "end": "2025-11-01T20:00:00+01:00",
        "value": 233.2
      },
      {
        "start": "2025-11-01T20:00:00+01:00",
        "end": "2025-11-01T21:00:00+01:00",
        "value": 232.24
      },
      {
        "start": "2025-11-01T21:00:00+01:00",
        "end": "2025-11-01T22:00:00+01:00",
        "value": 256.83
      },
      {
        "start": "2025-11-01T22:00:00+01:00",
        "end": "2025-11-01T23:00:00+01:00",
        "value": 267.82
      },
      {
        "start": "2025-11-01T23:00:00+01:00",
        "end": "2025-11-02T00:00:00+01:00",
        "value": 261.53
      },
      {
        "start": "2025-11-02T00:00:00+01:00",
        "end": "2025-11-02T01:00:00+01:00",
        "value": 261.02
      },
      {
        "start": "2025-11-02T01:00:00+01:00",
        "end": "2025-11-02T02:00:00+01:00",
        "value": 261.96
      },
      {
        "start": "2025-11-02T02:00:00+01:00",
        "end": "2025-11-02T03:00:00+01:00",
        "value": 263.99
      }
    ],
    "grid": [
      {
        "start": "2025-11-01T11:00:00+01:00",
        "end": "2025-11-01T12:00:00+01:00",
        "value": 0.018912
      },
      {
        "start": "2025-11-01T12:00:00+01:00",
        "end": "2025-11-01T13:00:00+01:00",
        "value": 0.025224
      },
      {
        "start": "2025-11-01T13:00:00+01:00",
        "end": "2025-11-01T14:00:00+01:00",
        "value": 0.036636
      },
      {
        "start": "2025-11-01T14:00:00+01:00",
        "end": "2025-11-01T15:00:00+01:00",
        "value": 0.080508
      },
      {
        "start": "2025-11-01T15:00:00+01:00",
        "end": "2025-11-01T16:00:00+01:00",
        "value": 0.101952
      },
      {
        "start": "2025-11-01T16:00:00+01:00",
        "end": "2025-11-01T17:00:00+01:00",
        "value": 0.105696
      },
      {
        "start": "2025-11-01T17:00:00+01:00",
        "end": "2025-11-01T18:00:00+01:00",
        "value": 0.11382
      },
      {
        "start": "2025-11-01T18:00:00+01:00",
        "end": "2025-11-01T19:00:00+01:00",
        "value": 0.105708
      },
      {
        "start": "2025-11-01T19:00:00+01:00",
        "end": "2025-11-01T20:00:00+01:00",
        "value": 0.10746
      },
      {
        "start": "2025-11-01T20:00:00+01:00",
        "end": "2025-11-01T21:00:00+01:00",
        "value": 0.112164
      },
      {
        "start": "2025-11-01T21:00:00+01:00",
        "end": "2025-11-01T22:00:00+01:00",
        "value": 0.10956
      },
      {
        "start": "2025-11-01T22:00:00+01:00",
        "end": "2025-11-01T23:00:00+01:00",
        "value": 0.1056
      },
      {
        "start": "2025-11-01T23:00:00+01:00",
        "end": "2025-11-02T00:00:00+01:00",
        "value": 0.103212
      }
    ],
    "planner": [
      {
        "start": "2025-11-01T11:00:00+01:00",
        "end": "2025-11-01T12:00:00+01:00",
        "value": 0.018912
      },
      {
        "start": "2025-11-01T12:00:00+01:00",
        "end": "2025-11-01T13:00:00+01:00",
        "value": 0.025224
      },
      {
        "start": "2025-11-01T13:00:00+01:00",
        "end": "2025-11-01T14:00:00+01:00",
        "value": 0.036636
      },
      {
        "start": "2025-11-01T14:00:00+01:00",
        "end": "2025-11-01T15:00:00+01:00",
        "value": 0.080508
      },
      {
        "start": "2025-11-01T15:00:00+01:00",
        "end": "2025-11-01T16:00:00+01:00",
        "value": 0.101952
      },
      {
        "start": "2025-11-01T16:00:00+01:00",
        "end": "2025-11-01T17:00:00+01:00",
        "value": 0.105696
      },
      {
        "start": "2025-11-01T17:00:00+01:00",
        "end": "2025-11-01T18:00:00+01:00",
        "value": 0.11382
      },
      {
        "start": "2025-11-01T18:00:00+01:00",
        "end": "2025-11-01T19:00:00+01:00",
        "value": 0.105708
      },
      {
        "start": "2025-11-01T19:00:00+01:00",
        "end": "2025-11-01T20:00:00+01:00",
        "value": 0.10746
      },
      {
        "start": "2025-11-01T20:00:00+01:00",
        "end": "2025-11-01T21:00:00+01:00",
        "value": 0.112164
      },
      {
        "start": "2025-11-01T21:00:00+01:00",
        "end": "2025-11-01T22:00:00+01:00",
        "value": 0.10956
      },
      {
        "start": "2025-11-01T22:00:00+01:00",
        "end": "2025-11-01T23:00:00+01:00",
        "value": 0.1056
      },
      {
        "start": "2025-11-01T23:00:00+01:00",
        "end": "2025-11-02T00:00:00+01:00",
        "value": 0.103212
      }
    ],
    "solar": {
      "scale": 0.866748838873644,
      "today": {
        "energy": 6088.98771876435,
        "complete": true
      },
      "tomorrow": {
        "energy": 13382.85631272,
        "complete": true
      },
      "dayAfterTomorrow": {
        "energy": 7614.59581576,
        "complete": true
      },
      "timeseries": [
        {
          "ts": "2025-11-01T01:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-01T02:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-01T03:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-01T04:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-01T05:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-01T06:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-01T07:00:00+01:00",
          "val": 18.90253348
        },
        {
          "ts": "2025-11-01T08:00:00+01:00",
          "val": 598.865002
        },
        {
          "ts": "2025-11-01T09:00:00+01:00",
          "val": 1449.32557608
        },
        {
          "ts": "2025-11-01T10:00:00+01:00",
          "val": 2486.5922452
        },
        {
          "ts": "2025-11-01T11:00:00+01:00",
          "val": 1946.89064196
        },
        {
          "ts": "2025-11-01T12:00:00+01:00",
          "val": 1904.87124936
        },
        {
          "ts": "2025-11-01T13:00:00+01:00",
          "val": 2293.297341
        },
        {
          "ts": "2025-11-01T14:00:00+01:00",
          "val": 2351.42358344
        },
        {
          "ts": "2025-11-01T15:00:00+01:00",
          "val": 1734.08409012
        },
        {
          "ts": "2025-11-01T16:00:00+01:00",
          "val": 629.075762
        },
        {
          "ts": "2025-11-01T17:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-01T18:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-01T19:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-01T20:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-01T21:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-01T22:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-01T23:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-02T00:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-02T01:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-02T02:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-02T03:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-02T04:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-02T05:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-02T06:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-02T07:00:00+01:00",
          "val": 9.67029192
        },
        {
          "ts": "2025-11-02T08:00:00+01:00",
          "val": 621.7178564
        },
        {
          "ts": "2025-11-02T09:00:00+01:00",
          "val": 1628.18265992
        },
        {
          "ts": "2025-11-02T10:00:00+01:00",
          "val": 2868.16755328
        },
        {
          "ts": "2025-11-02T11:00:00+01:00",
          "val": 3154.48378372
        },
        {
          "ts": "2025-11-02T12:00:00+01:00",
          "val": 1707.57715104
        },
        {
          "ts": "2025-11-02T13:00:00+01:00",
          "val": 1190.99028132
        },
        {
          "ts": "2025-11-02T14:00:00+01:00",
          "val": 1227.73481364
        },
        {
          "ts": "2025-11-02T15:00:00+01:00",
          "val": 707.42157156
        },
        {
          "ts": "2025-11-02T16:00:00+01:00",
          "val": 266.91034992
        },
        {
          "ts": "2025-11-02T17:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-02T18:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-02T19:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-02T20:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-02T21:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-02T22:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-02T23:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-03T00:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-03T01:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-03T02:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-03T03:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-03T04:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-03T05:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-03T06:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-03T07:00:00+01:00",
          "val": 3.19607688
        },
        {
          "ts": "2025-11-03T08:00:00+01:00",
          "val": 356.63158272
        },
        {
          "ts": "2025-11-03T09:00:00+01:00",
          "val": 475.1695602
        },
        {
          "ts": "2025-11-03T10:00:00+01:00",
          "val": 491.21453184
        },
        {
          "ts": "2025-11-03T11:00:00+01:00",
          "val": 872.6774682
        },
        {
          "ts": "2025-11-03T12:00:00+01:00",
          "val": 1434.42761216
        },
        {
          "ts": "2025-11-03T13:00:00+01:00",
          "val": 1490.3891832
        },
        {
          "ts": "2025-11-03T14:00:00+01:00",
          "val": 1096.38489236
        },
        {
          "ts": "2025-11-03T15:00:00+01:00",
          "val": 989.53909812
        },
        {
          "ts": "2025-11-03T16:00:00+01:00",
          "val": 404.96581008
        },
        {
          "ts": "2025-11-03T17:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-03T18:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-03T19:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-03T20:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-03T21:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-03T22:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-03T23:00:00+01:00",
          "val": 0
        },
        {
          "ts": "2025-11-04T00:00:00+01:00",
          "val": 0
        }
      ]
    }
  },
  "greenShareHome": 0.496,
  "greenShareLoadpoints": 0,
  "grid": {
    "power": 809.1,
    "energy": 34691.729,
    "powers": [
      751.5,
      -37.6,
      95.3
    ],
    "currents": [
      3.815,
      -1.062,
      1.217
    ]
  },
  "gridConfigured": true,
  "hems": {},
  "homePower": 1604.73,
  "influx": {
    "url": "",
    "database": "",
    "token": "",
    "org": "",
    "user": "",
    "password": "",
    "insecure": false
  },
  "interval": 10,
  "loadpoints": [
    {
      "batteryBoost": false,
      "chargeCurrents": [
        0,
        0,
        0
      ],
      "chargeDuration": 0,
      "chargePower": 0,
      "chargeTotalImport": 14575.312,
      "chargedEnergy": 0,
      "chargerFeatureHeating": false,
      "chargerFeatureIntegratedDevice": false,
      "chargerIcon": null,
      "chargerPhases1p3p": false,
      "chargerSinglePhase": false,
      "chargerStatusReason": "unknown",
      "charging": false,
      "connected": false,
      "connectedDuration": 17570,
      "disableDelay": 600,
      "disableThreshold": 200,
      "effectiveLimitSoc": 100,
      "effectiveMaxCurrent": 16,
      "effectiveMinCurrent": 6,
      "effectivePlanId": 0,
      "effectivePlanSoc": 0,
      "effectivePlanTime": null,
      "effectivePriority": 0,
      "enableDelay": 60,
      "enableThreshold": 0,
      "enabled": false,
      "limitEnergy": 0,
      "limitSoc": 0,
      "maxCurrent": 16,
      "minCurrent": 6,
      "mode": "pv",
      "offeredCurrent": 0,
      "phaseAction": "inactive",
      "phaseRemaining": 0,
      "phasesActive": 3,
      "phasesConfigured": 3,
      "planActive": false,
      "planEnergy": 0,
      "planOverrun": 0,
      "planPrecondition": 0,
      "planProjectedEnd": null,
      "planProjectedStart": null,
      "planTime": null,
      "priority": 0,
      "pvAction": "inactive",
      "pvRemaining": 0,
      "sessionCo2PerKWh": null,
      "sessionEnergy": 0,
      "sessionPrice": null,
      "sessionPricePerKWh": null,
      "sessionSolarPercentage": 0,
      "smartCostActive": true,
      "smartCostLimit": 0.106,
      "smartCostNextStart": null,
      "smartFeedInPriorityActive": false,
      "smartFeedInPriorityLimit": null,
      "smartFeedInPriorityNextStart": null,
      "title": "Garage",
      "vehicleClimaterActive": null,
      "vehicleDetectionActive": false,
      "vehicleIdentity": "",
      "vehicleLimitSoc": 0,
      "vehicleName": "",
      "vehicleOdometer": 0,
      "vehicleRange": 0,
      "vehicleSoc": 0,
      "vehicleTitle": "",
      "vehicleWelcomeActive": false
    }
  ],
  "messaging": true,
  "modbusproxy": null,
  "mqtt": {
    "broker": "",
    "user": "",
    "password": "",
    "clientID": "",
    "insecure": false,
    "caCert": "",
    "clientCert": "",
    "clientKey": "",
    "topic": "evcc"
  },
  "network": {
    "schema": "http",
    "host": "0.0.0.0",
    "port": 7070
  },
  "prioritySoc": 30,
  "pv": [
    {
      "power": 795.65
    }
  ],
  "pvEnergy": 0,
  "pvPower": 795.65,
  "residualPower": 100,
  "siteTitle": "Home",
  "smartCostAvailable": true,
  "smartCostType": "priceforecast",
  "smartFeedInPriorityAvailable": false,
  "sponsor": {
    "name": "",
    "expiresAt": "0001-01-01T00:00:00Z",
    "fromYaml": true
  },
  "startup": true,
  "statistics": {
    "30d": {
      "avgCo2": 205.460968595727,
      "avgPrice": 0.0710764769822102,
      "chargedKWh": 375.727800000001,
      "solarPercentage": 12.365785859151
    },
    "365d": {
      "avgCo2": 129.569643843673,
      "avgPrice": 0.040379672347933,
      "chargedKWh": 1242.07610000001,
      "solarPercentage": 44.3214952353875
    },
    "thisYear": {
      "avgCo2": 129.569643843673,
      "avgPrice": 0.040379672347933,
      "chargedKWh": 1242.07610000001,
      "solarPercentage": 44.3214952353875
    },
    "total": {
      "avgCo2": 129.569643843673,
      "avgPrice": 0.040379672347933,
      "chargedKWh": 1242.07610000001,
      "solarPercentage": 44.3214952353875
    }
  },
  "tariffCo2": 175.13,
  "tariffCo2Home": 88.298,
  "tariffCo2Loadpoints": 175.13,
  "tariffGrid": 0.025,
  "tariffPriceHome": 0.013,
  "tariffPriceLoadpoints": 0.025,
  "tariffSolar": 1904.871,
  "telemetry": false,
  "vehicles": {},
  "version": "0.207.5"
}